#использовать "../src"
#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРаботуКоманды");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКоманды() Экспорт

	cli = Новый КомандаПриложения("os", "я тут", Новый Структура);
	оп_v = cli.БулевоОпция("v vers", Ложь, "Тест");
	оп_s = cli.БулевоОпция("s ssss", Ложь, "Тест");
	оп_b = cli.БулевоОпция("b bbbb", Ложь, "Тест");
	//cli.Спек = "-v[-s | --ssss]-b";
	cli.НачалоЗапуска();
	ВходящиеАргументы = Новый Массив;
	ВходящиеАргументы.Добавить("-v");
	ВходящиеАргументы.Добавить("--ssss");
	ВходящиеАргументы.Добавить("-b");
	cli.ЧтениеАргументов(ВходящиеАргументы);

	Сообщить("-v "+ оп_v.Значение);
	Сообщить("-b "+ оп_b.Значение);
	Сообщить("-s "+ оп_s.Значение);
	
КонецПроцедуры