#использовать "../src"
#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРаботуКоманды");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКоманды() Экспорт

	cli = Новый КомандаПриложения("os", "я тут", Новый Структура);
	cli.БулевоОпция("v vers", Ложь, "Тест");
	cli.БулевоОпция("s ssss", Ложь, "Тест");
	cli.БулевоОпция("b bbbb", Ложь, "Тест");
	cli.Спек = "-v[-s]-b";
	cli.НачалоЗапуска();
	ВходящиеАргументы = Новый Массив;
	ВходящиеАргументы.Добавить("-v");
	ВходящиеАргументы.Добавить("-s");
	ВходящиеАргументы.Добавить("-b");
	cli.ЧтениеАргументов(ВходящиеАргументы);

КонецПроцедуры