#использовать "../src"
#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРаботуКоманды");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКоманды() Экспорт

	cli = Новый КомандаПриложения("os", "я тут", Новый Структура);
	оп_v = cli.БулевоОпция("v vers", Ложь, "Тест");
	оп_s = cli.БулевоОпция("s ssss", Ложь, "Тест");
	оп_b = cli.БулевоОпция("b bbbb", Ложь, "Тест");
	ARG = cli.СтрокаАргумент("ARG", "", "Тест");
	SRC = cli.СтрокаАргумент("SRC", "", "Тест");
	cli.Спек = "ARG -v[-s | --ssss]-b SRC";
	cli.НачалоЗапуска();
	ВходящиеАргументы = Новый Массив;
	ВходящиеАргументы.Добавить("Это очень крутой аргумент");
	ВходящиеАргументы.Добавить("-v");
	ВходящиеАргументы.Добавить("--ssss");
	ВходящиеАргументы.Добавить("-b");
	ВходящиеАргументы.Добавить("аргумент SRC");
	cli.ЧтениеАргументов(ВходящиеАргументы);

	Сообщить("-v "+ оп_v.Значение);
	Сообщить("-b "+ оп_b.Значение);
	Сообщить("-s "+ оп_s.Значение);
	Сообщить("ARG "+ ARG.Значение);
	Сообщить("SRC "+ SRC.Значение);
КонецПроцедуры