#использовать "../src"
#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	//ИменаТестов.Добавить("ТестДолжен_ПроверитьРаботуКоманды");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПриложения");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКоманды() Экспорт

	cli = Новый КомандаПриложения("os", "я тут", ЭтотОбъект);
	оп_v = cli.БулевоОпция("v vers", Ложь, "Тест");
	оп_s = cli.БулевоОпция("s ssss", Ложь, "Тест");
	оп_b = cli.БулевоОпция("b bbbb", Ложь, "Тест");
	ARG = cli.СтрокаАргумент("ARG", "", "Тест");
	SRC = cli.СтрокаАргумент("SRC", "", "Тест");
	cli.Спек = "ARG -v[-s | --ssss] -b SRC";
	cli.НачалоЗапуска();
	ВходящиеАргументы = Новый Массив;
	ВходящиеАргументы.Добавить("Это очень крутой аргумент");
	ВходящиеАргументы.Добавить("-v");
	ВходящиеАргументы.Добавить("--ssss");
	ВходящиеАргументы.Добавить("-b");
	ВходящиеАргументы.Добавить("аргумент SRC");
	cli.ЧтениеАргументов(ВходящиеАргументы);

	Сообщить("-v "+ оп_v.Значение);
	Сообщить("-b "+ оп_b.Значение);
	Сообщить("-s "+ оп_s.Значение);
	Сообщить("ARG "+ ARG.Значение);
	Сообщить("SRC "+ SRC.Значение);

КонецПроцедуры


Процедура ТестДолжен_ПроверитьПриложения() Экспорт


	cli = Новый КонсольноеПриложение("Тестовое приложение", "Выполняет полезную работу");
	cli.Версия("v version", "1.0");
	КомандаAve = cli.ДобавитьПодкоманду("a ave", "Команда ave", ЭтотОбъект);
	оп_v = КомандаAve.БулевоОпция("v vers", Ложь, "Тест");
	оп_s = КомандаAve.БулевоОпция("s ssss", Ложь, "Тест");
	оп_b = КомандаAve.БулевоОпция("b bbbb", Ложь, "Тест");
	ARG = КомандаAve.СтрокаАргумент("ARG", "", "Тест");
	SRC = КомандаAve.СтрокаАргумент("SRC", "", "Тест");
	КомандаAve.Спек = "-v [-s | --ssss] -b ARG SRC";

	ВходящиеАргументы = Новый Массив;
	ВходящиеАргументы.Добавить("ave");
	ВходящиеАргументы.Добавить("-v");
	ВходящиеАргументы.Добавить("--ssss");
	ВходящиеАргументы.Добавить("-b");
	ВходящиеАргументы.Добавить("Это очень крутой аргумент");
	ВходящиеАргументы.Добавить("аргумент SRC");
	cli.Запустить(ВходящиеАргументы);

	Сообщить("-v "+ оп_v.Значение);
	Сообщить("-b "+ оп_b.Значение);
	Сообщить("-s "+ оп_s.Значение);
	Сообщить("ARG "+ ARG.Значение);
	Сообщить("SRC "+ SRC.Значение);
	
КонецПроцедуры


Процедура ВыполнитьКоманду() Экспорт
	
	Сообщить("Полезная работа");

КонецПроцедуры 