#использовать "../src/core"
#Использовать asserts
Перем V, B, S, ARG, SRC;
Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ТолькоАргументы");
	//ИменаТестов.Добавить("ТестДолжен_ТолькоОпции");
	//ИменаТестов.Добавить("ТестДолжен_ПроверитьПриложения");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ТолькоАргументы() Экспорт

	Приложение = Новый КонсольноеПриложение("cp", "");

	DST = Приложение.Аргумент("DST", "", "Тест");
	SRC = Приложение.Аргумент("SRC", "", "Тест").ТМассивСтрок();;

	Приложение.УстановитьСпек("SRC... DST");
	Приложение.УстановитьОсновноеДействие(ЭтотОбъект);

	МассивSRC = Новый Массив;
	МассивSRC.Добавить("src1");
	МассивSRC.Добавить("src2");

	ВходящиеАргументы = Новый Массив;
	ВходящиеАргументы.Добавить("src1");
	ВходящиеАргументы.Добавить("src2");
	ВходящиеАргументы.Добавить("dst");

	Приложение.Запустить(ВходящиеАргументы);
	
	Утверждения.ПроверитьРавенство(DST.Значение, "dst", "Аргумент DST не равен ожидаемому");
	Утверждения.ПроверитьРавенство(SRC.Значение.Количество(), МассивSRC.Количество(), "Аргумент SRC не равен ожидаемому");


КонецПроцедуры

Процедура ВыполнитьКоманду(Знач Команда) Экспорт

КонецПроцедуры 

Функция ИмяФункции()
	
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.lib.cli_command");
//Лог.УстановитьУровень(УровниЛога.Отладка);