#использовать "../src/core"
#Использовать asserts
#Использовать logos
#Использовать delegate

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСкоростьРаботуКомандыПриложения");
	//ИменаТестов.Добавить("ТестДолжен_ПроверитьСкоростьРаботуКомандыПриложения");
	//ИменаТестов.Добавить("ТестДолжен_ПроверитьПриложения");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьСкоростьРаботуКомандыПриложения() Экспорт
	
	Спек = "[--login] [--realm] [--note] [--no-copy] [--gen [--length] [--min-length] [--max-length] [--no-upper] [--no-lower] [--no-digit] [--no-symbol] [--no-similar] [--min-upper] [--max-upper] [--min-lower] [--max-lower] [--min-digit] [--max-digit] [--min-symbol] [--max-symbol] [--exclude]]";
	ИмяПроцедурыОбъекта = "КомандаСкоростьРаботуКомандыПриложения";

	ТестовыеСлучаи = Новый Массив;

	
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("", Спек, Истина));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--gen", Спек, Истина));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--gen --length 42", Спек, Истина));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--length 42 --gen", Спек, Истина));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--min-length 10 --length 42 --gen", Спек, Истина));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--min-length 10 --no-symbol --no-lower --length 42 --gen", Спек, Истина));
	
	Для каждого Тест Из ТестовыеСлучаи Цикл
		
		РезультатВыполнения = ВыполненаКомандаПриложения(Тест.Спек, ИмяПроцедурыОбъекта, Тест.Аргументы);

		Утверждения.ПроверитьРавенство(РезультатВыполнения, Тест.Результат, "Команда должна выполниться успешно! Входящие аргументы" + СтрСоединить(Тест.Аргументы));

	КонецЦикла;



КонецПроцедуры

Функция АргументыИзСтроки(СтрокаАргументов)

	Возврат СтрРазделить(СтрокаАргументов, " ");
	
КонецФункции


Функция ТестовыйСлучай(Знач Аргументы, Знач Спек, Знач Результат)
	
	Тест = Новый Структура;
	Тест.Вставить("Аргументы", СтрРазделить(Аргументы," "));
	Тест.Вставить("Спек", Спек);
	Тест.Вставить("Результат", Результат);

	Возврат Тест;
КонецФункции


Функция ВыполненаКомандаПриложения(Спек, ИмяПроцедурыОбъекта, Аргументы)
	
	Команда = Новый КомандаПриложения("test", "Тестовая команда", ЭтотОбъект);
	
	ПараметрыВыполнения = Новый Массив;
	ПараметрыВыполнения.Добавить(Команда);

	ОписаниеКоманды = Делегаты.Создать(ЭтотОбъект, ИмяПроцедурыОбъекта);
	ОписаниеКоманды.Исполнить(ПараметрыВыполнения);

	Команда.Спек = Спек;

	Команда.НачалоЗапуска();
	Попытка
		Команда.Запуск(Аргументы);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

Процедура КомандаСкоростьРаботуКомандыПриложения(Команда) Экспорт
	
	login = Команда.Опция("login", "", "Login for credential, e.g. username or email.").ТСтрока();
	realm = Команда.Опция("realm", "", "Realm for credential, e.g. website or WiFi AP name.").ТСтрока();
	note = Команда.Опция("note", "", "Note for credential.").ТСтрока();
	noCopy = Команда.Опция("no-copy", false, "Do not copy generated password to the clipboard.").Флаг();
	gen = Команда.Опция("gen", false, "Generate a password.").Флаг();
	length = Команда.Опция("length", 0, "Password length.").Тчисло();
	minLength = Команда.Опция("min-length", 30, "Minimum length password.").Тчисло();
	maxL = Команда.Опция("max-length", 40, "Maximum length password.").Тчисло();
	noUpper = Команда.Опция("no-upper", false, "Exclude uppercase characters in password.").Флаг();
	noLow = Команда.Опция("no-lower", false, "Exclude lowercase characters in password.").Флаг();
	noDigit = Команда.Опция("no-digit", false, "Exclude digit characters in password.").Флаг();
	noSymbol = Команда.Опция("no-symbol", false, "Exclude symbol characters in password.").Флаг();
	noSimilar = Команда.Опция("no-similar", false, "Exclude similar characters in password.").Флаг();
	minUpper = Команда.Опция("min-upper", 0, "Minimum number of uppercase characters in password.").Тчисло();
	maxUpper = Команда.Опция("max-upper", -1, "Maximum number of uppercase characters in password.").Тчисло();
	minLow = Команда.Опция("min-lower", 0, "Minimum number of lowercase characters in password.").Тчисло();
	maxLow = Команда.Опция("max-lower", -1, "Maximum number of lowercase characters in password.").Тчисло();
	minDigit = Команда.Опция("min-digit", 0, "Minimum number of digit characters in password.").Тчисло();
	maxDigit = Команда.Опция("max-digit", -1, "Maximum number of digit characters in password.").Тчисло();
	minSym = Команда.Опция("min-symbol", 0, "Minimum number of symbol characters in password.").Тчисло();
	maxSym = Команда.Опция("max-symbol", -1, "Maximum number of symbol characters in password.").Тчисло();
	ex = Команда.Опция("exclude", "", "Exclude specific characters from password.").ТСтрока();

КонецПроцедуры

Процедура ВыполнитьКоманду(Знач Команда) Экспорт
	Лог.Отладка("Полезная работа команды: %1", Команда.ПолучитьИмяКоманды());	
КонецПроцедуры 

Лог = Логирование.ПолучитьЛог("oscript.lib.cli_command");
Лог.УстановитьУровень(УровниЛога.Отладка);