#использовать "../src/core"
#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингБулевоОпций");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингОпций");

	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьПарсингБулевоОпций()
	

	force = Опция("f force",  Ложь).Флаг();
	g = Опция("g",  Ложь).Флаг();
	x = Опция("x",  Ложь).Флаг();
	y = Опция("y",  Ложь).Флаг();

	ИндексОпций = Новый Соответствие;
	ИндексОпций.Вставить("-f", force);
	ИндексОпций.Вставить("--force", force);
	ИндексОпций.Вставить("-g", g);
	ИндексОпций.Вставить("-x", x);
	ИндексОпций.Вставить("-y", y);

	О_Парсера = Новый ОпцияПарсера(force, ИндексОпций);
	Утверждения.ПроверитьРавенство("-f", О_Парсера.ВСтроку(), "Парсер опции должен быть равен -f");

	ТестовыеСлучаи = Новый Массив:

	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-f x", "x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-f=true x", "x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-f=false x", "x", "Ложь"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--force x", "x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--force=true x", "x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--force=false x", "x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-fgxy x", "-gxy x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-gfxy x", "-gxy x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-gxfy x", "-gxy x", "Истина"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-gxyf x", "-gxy x", "Истина"));
	
	Для каждого Тест Из ТестовыеСлучаи Цикл
		
		Контекст = Новый КонтекстПарсеров();
		Результат = О_Парсера.Поиск(Тест.Аргументы, Контекст)
		Утверждения.ПроверитьИстину(Результат.РезультатПоиска, "Опция (-f) должен быть найдена");
		Утверждения.ПроверитьРавенство(СтрСоединить(Результат.Аргументы, " "), СтрСоединить(Тест.АргументыВыхода, " "), "Аргументы выходные должны быть равны");
		Утверждения.ПроверитьРавенство(1, Контекст.Опции[О_Парсера.Опция].Количество(), "Количество результатов должно быть 1");
		Утверждения.ПроверитьРавенство(Контекст.Опции[О_Парсера.Опция][0], Булево(Тест.ЗначениеОпции[0]), "Ожидаемые результаты должны быть равны");

		Контекст = Новый КонтекстПарсеров();
		Контекст.СбросОпций = Истина;
		Результат = О_Парсера.Поиск(Тест.Аргументы, Контекст)
		Утверждения.ПроверитьЛожь(Результат.РезультатПоиска, "Опция (-f) не должена быть найдена");

	КонецЦикла;

КонецПроцедуры

Функция ТестовыйСлучай(Знач Аргументы, Знач АргументыВыхода, Знач ЗначениеОпции)
	
	Тест = Новый Соответствие;
	Тест.Вставить("Аргументы", СтрРазделить(Аргументы," "));
	Тест.Вставить("АргументыВыхода", СтрРазделить(АргументыВыхода," "));
	Тест.Вставить("ЗначениеОпции", СтрРазделить(ЗначениеОпции," "));

	Возврат Тест;
КонецФункции

Процедура ТестДолжен_ПроверитьПарсингОпций()
	

	НаименованияОпции  = Новый Массив;
	НаименованияОпции.Добавить("-f");
	НаименованияОпции.Добавить("--force");

	МассивОпций = Новый Массив;
	МассивОпций.Добавить(Опция("f force", "").ТСтрока());
	МассивОпций.Добавить(Опция("f force", Новый Массив).ТМассивСтрок());
	МассивОпций.Добавить(Опция("f force", "").ТЧисло());
	МассивОпций.Добавить(Опция("f force", Новый Массив).ТМассивЧисел());
	// TODO Написать отдельную проверку для дат
	//МассивОпций.Добавить(Опция("f force", "".ТДата());
	//МассивОпций.Добавить(Опция("f force", Новый Массив).ТМассивДат());


	ТестовыеСлучаи = Новый Массив:

	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-f x", "", "x"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-f=x y", "y", "x"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-fx y", "y", "x"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-afx y", "-a y", "x"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("-af x y", "-a y", "x"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--force x", "", "x"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("--force=x y", "y", "x"));
	
	a = Новый ПараметрКоманды("опция", "a",  Ложь, "Тестовый параметр a");


	Для каждого Тест Из ТестовыеСлучаи Цикл
		
			
		Для каждого ОпцияForce Из МассивОпций Цикл
			
			ИндексОпций = Новый Соответствие;
			ИндексОпций.Вставить("-f", ОпцияForce);
			ИндексОпций.Вставить("--force", ОпцияForce);
			ИндексОпций.Вставить("-a", a);
			
			О_Парсера = Новый ОпцияПарсера(ОпцияForce, ИндексОпций);
			Утверждения.ПроверитьРавенство("-f", О_Парсера.ВСтроку(), "Парсер опции должен быть равен -f");
		
			Контекст = Новый КонтекстПарсеров();
			Результат = О_Парсера.Поиск(Тест.Аргументы, Контекст)
			Утверждения.ПроверитьИстину(Результат.РезультатПоиска, "Опция (-f) должен быть найдена");
		
			Утверждения.ПроверитьРавенство(СтрСоединить(Результат.Аргументы, " "), СтрСоединить(Тест.АргументыВыхода, " "), "Аргументы выходные должны быть равны");
			Утверждения.ПроверитьРавенство(1, Контекст.Опции[О_Парсера.Опция].Количество(), "Количество результатов должно быть 1");
			Утверждения.ПроверитьРавенство(Контекст.Опции[О_Парсера.Опция][0], Тест.ЗначениеОпции[0], "Ожидаемые результаты должны быть равны");

			Контекст = Новый КонтекстПарсеров();
			Контекст.СбросОпций = Истина;
			Результат = О_Парсера.Поиск(Тест.Аргументы, Контекст)
			Утверждения.ПроверитьЛожь(Результат.РезультатПоиска, "Опция (-f) не должена быть найдена");


		КонецЦикла;
		
	КонецЦикла;	

КонецПроцедуры


Функция Опция(Наименование, ЗначениеПоУмолчанию)
	Возврат Новый ПараметрКоманды("опция", Наименование,  ЗначениеПоУмолчанию, "Тестовый параметр f")
КонецФункции